ext_alsav_zup/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Сотрудники</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ext_alsav_zup/Catalogs/Сотрудники/Ext/ManagerModule.bsl
Функция ЗаполнитьДанныеПаспортаНаСервере() ЭКСПОРТ
	сотрудники = Справочники.Сотрудники.Выбрать();
	Пока сотрудники.Следующий() Цикл
		сотрудник = сотрудники.Ссылка;
		ЗаполнитьДопРеквСотрудник(сотрудник);
	КонецЦикла;

	
	
	физЛица = Справочники.ФизическиеЛица.Выбрать();
	Пока физЛица.Следующий() Цикл
		физЛицо = физЛица.Ссылка;
		ЗаполнитьДопРеквФизЛицо(физЛицо);
	КонецЦикла; 

КонецФункции

Функция ЗаполнитьДопРеквСотрудник(сотрудник) ЭКСПОРТ
	фРезалт = Ложь;
	Если (НЕ сотрудник.ЭтоГруппа) Тогда
		ДанныеСотрудника = КадровыйУчет.КадровыеДанныеСотрудников(ложь, сотрудник, "ДатаПриема, Подразделение, Должность, ПриказОПриеме");
		Попытка
			соот = Новый Соответствие;
			соот.Вставить("ДатаПриема",ДанныеСотрудника[0].ДатаПриема);
			соот.Вставить("Должность", ДанныеСотрудника[0].Должность);
			соот.Вставить("Подразделение", ДанныеСотрудника[0].Подразделение);
			
			соот.Вставить("ПриказОПриеме.СовокупнаяТарифнаяСтавка", ДанныеСотрудника[0].ПриказОПриеме.СовокупнаяТарифнаяСтавка);
			соот.Вставить("ПриказОПриеме.СовокупнаяТарифнаяСтавкаПрописью", ЧислоПрописью(ДанныеСотрудника[0].ПриказОПриеме.СовокупнаяТарифнаяСтавка, "Л=ru_RU; ДП=Ложь","рубль, рубля, рублей, м, копейка, копейки, копеек, ж"));
			соот.Вставить("ПриказОПриеме.ТрудовойДоговорНомер", ДанныеСотрудника[0].ПриказОПриеме.ТрудовойДоговорНомер);
			соот.Вставить("ПриказОПриеме.ДлительностьИспытательногоСрока", ДанныеСотрудника[0].ПриказОПриеме.ДлительностьИспытательногоСрока);
			
			ФорматнаяСтрока = "Л=ru_RU"; 
			ПараметрыПредметаИсчисления = " , , , , , , , , 0"; 
			соот.Вставить(
				"ПриказОПриеме.ДлительностьИспытательногоСрокаПрописью",
				ЧислоПрописью(ДанныеСотрудника[0].ПриказОПриеме.ДлительностьИспытательногоСрока, ФорматнаяСтрока, ПараметрыПредметаИсчисления)
			);
			об = сотрудник.ПолучитьОбъект();                              
			
			Для Каждого кв из соот Цикл
				Если (СокрЛП(алсав_ДопРеквизиты.ПолучитьДопРеквизит(об,кв.Ключ)) <> СокрЛП(кв.Значение)) Тогда
					алсав_ДопРеквизиты.УстановитьЗначениеДопРеквизита(об, кв.Ключ, кв.Значение);
					фРезалт = истина;
				Конецесли;
			КонецЦикла;
			
			Если фРезалт Тогда
				об.ОбменДанными.Загрузка = ИСТИНА;
				об.Записать();
			КонецЕсли;
		Исключение
		Конецпопытки;
	КонецЕсли;        
	
	Возврат фРезалт;
КонецФункции

Функция ЗаполнитьДопРеквФизЛицо(физЛицо) ЭКСПОРТ
	фРезалт = Ложь;
	Если (НЕ физЛицо.ЭтоГруппа) Тогда
		ДанныеФизЛица = КадровыйУчет.ДокументыФизическихЛиц(физЛицо, Истина); 
		Попытка                       
			
			Если ЛОЖЬ Тогда ДанныеФизЛица = Новый ТаблицаЗначений; КонецЕсли;
			мУдалениеСтрок = новый Массив;
			Для Каждого стр из ДанныеФизЛица Цикл
				Если стр.СрокДействия < НачалоДня(ТекущаяДата()) Тогда
					мУдалениеСтрок.Добавить(стр);
				КонецЕсли;
			КонецЦикла;           
			Для Каждого стр из мУдалениеСтрок Цикл
				ДанныеФизЛица.Удалить(стр);
			КонецЦикла;
			//стрПаспорт = ДанныеФизЛица.Найти(Истина, "ВидДокумента");
			стрПаспорт = ДанныеФизЛица.Найти(Истина, "ЯвляетсяДокументомУдостоверяющимЛичность");
			Если ЗначениеЗаполнено(стрПаспорт) Тогда
				
				соот = Новый Соответствие;
				соот.Вставить("Паспорт.Серия",стрПаспорт.Серия);
				соот.Вставить("Паспорт.Номер", стрПаспорт.Номер);
				соот.Вставить("Паспорт.КемВыдан", "" + СокрЛП(стрПаспорт.КемВыдан)+ ", " + Формат(стрПаспорт.ДатаВыдачи, "ДЛФ=D"));
				соот.Вставить("Паспорт.КодПодразделения", стрПаспорт.КодПодразделения);
				об = физЛицо.ПолучитьОбъект();
				
				Для Каждого кв из соот Цикл
					Если (СокрЛП(алсав_ДопРеквизиты.ПолучитьДопРеквизит(об,кв.Ключ)) <> СокрЛП(кв.Значение)) Тогда
						алсав_ДопРеквизиты.УстановитьЗначениеДопРеквизита(об, кв.Ключ, кв.Значение);
						фРезалт = истина;
					Конецесли;
				КонецЦикла;
				
				Если фРезалт Тогда
					об.ОбменДанными.Загрузка = ИСТИНА;
					об.Записать();
				КонецЕсли;      
				
			КонецЕсли;
		Исключение
		Конецпопытки;
	КонецЕсли;       
	Возврат фРезалт;
КонецФункции

Функция ЗаполнитьДопРеквОрганизация(организация) ЭКСПОРТ   

	фРезалт = Ложь;
	Если (НЕ организация.ЭтоГруппа) Тогда
		ДанныеОтветственныхЛиц = ЗарплатаКадры.ОтветственныеЛицаОрганизации(организация, "Руководитель,ДолжностьРуководителя,ГлавныйБухгалтер", ТекущаяДата());
		СведенияОбОрганизации = ЗарплатаКадры.ПолучитьСведенияОбОрганизации(Организация, ТекущаяДата());
		//СведенияОбОрганизации = ЗарплатаКадры.ПолучитьСведенияОбОрганизации(Организация, ТекущаяДата(), "БанкСчетБИКБанка, БанкСчетКоррСчетБанка, БанкСчетНаимБанка, БанкСчетНомер");
		Попытка
			соот = Новый Соответствие;
			соот.Вставить("Руководитель",ПолучитьСотрудникаПоФизЛицу(ДанныеОтветственныхЛиц.Руководитель, организация));
			соот.Вставить("ДолжностьРуководителя", ДанныеОтветственныхЛиц.ДолжностьРуководителя);			
			//соот.Вставить("ГлавныйБухгалтер", ПолучитьСотрудникаПоФизЛицу(ДанныеОтветственныхЛиц.ГлавныйБухгалтер, организация));
			об = организация.ПолучитьОбъект();
			
			Для Каждого кв из соот Цикл
				Если (СокрЛП(алсав_ДопРеквизиты.ПолучитьДопРеквизит(об,кв.Ключ)) <> СокрЛП(кв.Значение)) Тогда
					алсав_ДопРеквизиты.УстановитьЗначениеДопРеквизита(об, кв.Ключ, кв.Значение);
					фРезалт = истина;
				Конецесли;
			КонецЦикла;
			
			Если фРезалт Тогда
				об.ОбменДанными.Загрузка = ИСТИНА;
				об.Записать();
			КонецЕсли;
		Исключение
		Конецпопытки;
	КонецЕсли;       
	Возврат фРезалт;
КонецФункции     


Функция ПолучитьСотрудникаПоФизЛицу(физЛицо, Организация)
	
	Запрос = Новый Запрос; 

	Запрос.УстановитьПараметр("ФизическоеЛицо", физЛицо);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",Организация);

	Запрос.Текст = "ВЫБРАТЬ
	            |	Сотрудники.Ссылка КАК Ссылка
	            |ИЗ
	            |	Справочник.Сотрудники КАК Сотрудники
	            |ГДЕ
	            |	Сотрудники.ФизическоеЛицо = &ФизическоеЛицо
	            |	И Сотрудники.ГоловнаяОрганизация = &ГоловнаяОрганизация";

	рез = Запрос.Выполнить().Выбрать();

	Если рез.Следующий() Тогда
		возврат рез.Ссылка;
  	КонецЕсли;

	Возврат Справочники.Сотрудники.ПустаяСсылка();
КонецФункции
